### terraform plan: `prod`

<details>
<summary>🟢 <strong>terraform init</strong></summary>  

~~~
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- group_committee in ../../modules/group
- nextcloud_client in ../../modules/oidc-client
- realm in ../../modules/realm
- website_v4_client in ../../modules/oidc-client
- wiki_client in ../../modules/oidc-client
Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of keycloak/keycloak from the dependency lock file
- Installing hashicorp/aws v6.5.0...
- Installed hashicorp/aws v6.5.0 (signed by HashiCorp)
- Installing keycloak/keycloak v5.3.0...
- Installed keycloak/keycloak v5.3.0 (self-signed, key ID A63FAED146E27E2A)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://developer.hashicorp.com/terraform/cli/plugins/signing

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
~~~             
</details>

&nbsp;&nbsp;&nbsp;🟢 <strong>terraform fmt-check</strong>

<details>
<summary>🟢 <strong>terraform validate</strong></summary>  

~~~
Success! The configuration is valid.
~~~             
</details>

<details>
<summary>🟢 <strong>terraform plan</strong> (2 to add, 0 to change, 0 to destroy)</summary>  

~~~
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.nextcloud_client.keycloak_openid_client.default will be created
  + resource "keycloak_openid_client" "default" {
      + access_token_lifespan                     = (known after apply)
      + access_type                               = "CONFIDENTIAL"
      + admin_url                                 = (known after apply)
      + always_display_in_console                 = false
      + backchannel_logout_session_required       = true
      + base_url                                  = (known after apply)
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "nextcloud"
      + client_offline_session_idle_timeout       = (known after apply)
      + client_offline_session_max_lifespan       = (known after apply)
      + client_secret                             = (sensitive value)
      + client_secret_wo                          = (write-only attribute)
      + client_session_idle_timeout               = (known after apply)
      + client_session_max_lifespan               = (known after apply)
      + consent_required                          = (known after apply)
      + consent_screen_text                       = (known after apply)
      + description                               = (known after apply)
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = (known after apply)
      + enabled                                   = true
      + exclude_issuer_from_auth_response         = (known after apply)
      + exclude_session_state_from_auth_response  = (known after apply)
      + frontchannel_logout_enabled               = (known after apply)
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + import                                    = false
      + name                                      = "Nextcloud"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "prod"
      + resource_server_id                        = (known after apply)
      + root_url                                  = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = true
      + standard_token_exchange_enabled           = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = true
      + valid_post_logout_redirect_uris           = [
          + "https://nextcloud.bts-crew.com/*",
        ]
      + valid_redirect_uris                       = [
          + "https://nextcloud.bts-crew.com/*",
        ]
      + web_origins                               = [
          + "+",
        ]
    }

  # module.nextcloud_client.keycloak_role.restrict_account[0] will be created
  + resource "keycloak_role" "restrict_account" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = "Only users with this role can access this client"
      + id              = (known after apply)
      + import          = false
      + name            = "client-access"
      + realm_id        = "prod"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"
~~~             
</details>

---
[View the run details](https://github.com/backstage-technical-services/keycloak/actions/runs/17593263301?check_suite_focus=true)
<!-- thollander/actions-comment-pull-request "prod" -->